{
  "ROUTES": {
    "HOME": "Home",
    "PROJECTS": "Projects",
    "ARTICLES": "Articles",
    "CONTACT": "Contact"
  },
  "COMMON": {
    "SEE_ALL": "See all"
  },
  "HEADER": {
    "TITLE": "Hey, I’m Jose Romero.\n Front-end developer \n Based in Barcelona, ES.",
    "TITLE_SMALL": "Jose Romero",
    "DESCRIPTION": "I've launched this minimalist portfolio where I'll share my work as a developer, along with my personal projects, ideas, and experiences. Everything that's part of my journey and inspires me to keep creating.",
    "DESCRIPTION_PROJECTS": "Ideas turned into code. Small projects where I experiment, learn, and bring new solutions to life.",
    "DESCRIPTION_ARTICLES": "Thoughts, experiences, and lessons about life, technology, fitness, and everything that inspires me to keep growing.",
    "DESCRIPTION_CONTACT": "Have a project in mind or just want to say hi? Let’s make something great together.",
    "CONTACT": "Get in touch →"
  },
  "FOOTER": {
    "TITLE": "© 2025 - Made with ♥ by Jose Romero"
  },
  "PROJECTS": {
    "TITLE": "Projects",
    "VIEW": "View project →",
    "PROJECT_1_TITLE": "Ignis Gravitas",
    "PROJECT_1_DESCRIPTION": "A digital accelerator for startups and an exclusive, growing entrepreneurial ecosystem.",
    "PROJECT_2_TITLE": "Profit4life",
    "PROJECT_2_DESCRIPTION": "Academy dedicated to Forex and the management of investments and financial opportunities.",
    "PROJECT_3_TITLE": "Átomo Virtual",
    "PROJECT_3_DESCRIPTION": "Web development agency, designing websites and platforms optimized for search engine ranking.",
    "PROJECT_4_TITLE": "App para correr",
    "PROJECT_4_DESCRIPTION": "Un rastreador de carreras claro y rápido para registrar distancia, ritmo y tiempo, diseñado para la simplicidad y la concentración.",
    "PROJECT_5_TITLE": "App del tiempo",
    "PROJECT_5_DESCRIPTION": "Una app minimalista del tiempo que muestra pronósticos en tiempo real e imágenes claras para cualquier ubicación.",
    "PROJECT_6_TITLE": "App de tareas",
    "PROJECT_6_DESCRIPTION": "Un gestor de tareas sencillo y eficaz para organizar tus objetivos diarios y mantenerte productivo."
  },
  "ARTICLES": {
    "TITLE": "Articles",
    "VIEW": "Read →",
    "ARTICLE_1_TITLE": "The Magic of Setting Up Angular",
    "ARTICLE_1_DESCRIPTION": "Your Angular project doesn’t need magic, just a good setup. There are two types of developers: those who set up a project well from the start, and those who, six months later, hate opening their own code. \n \n And I don’t judge you if you’re in the second group… we’ve all been there. \n \n Setting up an Angular project isn’t the most “exciting” thing in the world. No one brags on LinkedIn about creating a clean tsconfig or a properly separated environment. But if you do it right from the beginning, you’ll save yourself nights of frustration and commits with messages like “final fix FINAL FINAL”. \n \n Think of a poorly configured project like a messy room: at first, it doesn’t matter, but eventually, you can’t even find your socks. \n \n The same happens with components, services, and modules: if you don’t organize them from day one, you’ll end up with a tangled mess. A good starting point is to define a clear folder structure (by features, by domain, or whatever fits your team), a shared module, and make sure everyone follows the same conventions. That, plus a few tools like eslint, prettier, and husky, can make the difference between a scalable project and a TypeScript nightmare. \n \n And here’s the important part: it’s not just about code. You’re also setting up how you work. Your future team (or your “future self” three months from now) will thank you. \n \n So before rushing into your first ng g c, grab a coffee, take a breath, and get everything organized. It’s not magic — it’s just good practice. \n \n As the dev saying goes: “better to lose one hour configuring than a hundred hours fixing.”",
    "ARTICLE_2_TITLE": "You Don’t Need to Be an Athlete to Take Care of Your Body",
    "ARTICLE_2_DESCRIPTION": "Sometimes we think working out means living at the gym, drinking protein that tastes like cardboard, and posting selfies with your 'beast mode' face. But the truth is, your body doesn’t ask for that much. It just asks you to move, that’s all. \n \n Most of the time, we spend our day sitting: at work, in the car, watching Netflix… and the worst part is, we get used to it. Until one day, you climb a couple of stairs and your body says, “dude, when was the last time we did this?” \n \n The good news is, you don’t need an extreme routine to improve. Walking for 30 minutes, stretching when you wake up, or taking the stairs instead of the elevator already makes a difference. Your body starts working better, your mind clears up, and your stress levels drop. \n \n There are even studies showing that moving a few minutes every hour boosts productivity and focus. So it’s not just about looking better — it’s about feeling better. \n \n And yes, there will be days when you don’t feel like it. On those days, change your focus: don’t do it for looks, do it for well-being. Do it for that moment when you wake up with energy, or that feeling after training when you think, “it was worth it.” \n \n Because, let’s be honest, we all prefer 20 minutes of movement over 20 minutes of complaining.",
    "ARTICLE_3_TITLE": "Habits Are Like Bank Interest",
    "ARTICLE_3_DESCRIPTION": "Habits are like bank interest: small, but over time, they change your life. \n \n When we talk about “habits,” many people think of boring stuff: waking up early, eating healthy, reading every day… and it sounds like a to-do list you don’t really want to follow. But the trick is to see them differently — not as an obligation, but as a tool to make your life easier. \n \n Habits are nothing more than shortcuts for your brain. They’re the things you do without thinking — and that’s what makes them powerful. If you go to bed every night scrolling through your phone, that’s a habit. If you drink a glass of water when you wake up, that’s one too. The difference is which ones bring you closer to what you want and which ones pull you away. \n \n And no, you don’t need to change your whole life in a week. Start with something small: make your bed, go for a walk, write down three things you’re grateful for, or simply plan your day. When you repeat an action, your brain creates a faster path. And over time, it stops feeling like effort — it becomes automatic. \n \n Suddenly, without realizing it, you no longer need “motivation” to be productive. You just follow your system. And that’s the real secret of organization: not having infinite willpower, but building an environment where your good habits work for you. \n \n Results don’t come overnight, but when they do, it feels like magic. Because yes, habits are small… but over time, they become your superpower."
  },
  "CONTACT": {
    "TITLE": "Contact",
    "DOWNLOAD_CV": "Download CV"
  }
}
