{
  "ROUTES": {
    "HOME": "Home",
    "PROJECTS": "Projects",
    "ARTICLES": "Articles",
    "CONTACT": "Contact"
  },
  "COMMON": {
    "SEE_ALL": "See all"
  },
  "HEADER": {
    "TITLE": "Hey, I’m Jose Romero.\n Front-end developer \n Based in Barcelona, ES.",
    "TITLE_SMALL": "Jose Romero",
    "DESCRIPTION": "I've launched this minimalist portfolio where I'll share my work as a developer, along with my personal projects, ideas, and experiences. Everything that's part of my journey and inspires me to keep creating.",
    "DESCRIPTION_PROJECTS": "Ideas turned into code. Small projects where I experiment, learn, and bring new solutions to life.",
    "DESCRIPTION_ARTICLES": "Thoughts, experiences, and lessons about life, technology, fitness, and everything that inspires me to keep growing.",
    "DESCRIPTION_CONTACT": "Have a project in mind or just want to say hi? Let’s make something great together.",
    "CONTACT": "Get in touch →"
  },
  "FOOTER": {
    "TITLE": "© 2025 - Made with ♥ by Jose Romero"
  },
  "PROJECTS": {
    "TITLE": "Projects",
    "VIEW": "View project →",
    "PROJECT_1_TITLE": "Ignis Gravitas",
    "PROJECT_1_DESCRIPTION": "A digital accelerator for startups and an exclusive, growing entrepreneurial ecosystem.",
    "PROJECT_2_TITLE": "Profit4life",
    "PROJECT_2_DESCRIPTION": "Academy dedicated to Forex and the management of investments and financial opportunities.",
    "PROJECT_3_TITLE": "Átomo Virtual",
    "PROJECT_3_DESCRIPTION": "Web development agency, designing websites and platforms optimized for search engine ranking.",
    "PROJECT_4_TITLE": "App para correr",
    "PROJECT_4_DESCRIPTION": "Un rastreador de carreras claro y rápido para registrar distancia, ritmo y tiempo, diseñado para la simplicidad y la concentración.",
    "PROJECT_5_TITLE": "App del tiempo",
    "PROJECT_5_DESCRIPTION": "Una app minimalista del tiempo que muestra pronósticos en tiempo real e imágenes claras para cualquier ubicación.",
    "PROJECT_6_TITLE": "App de tareas",
    "PROJECT_6_DESCRIPTION": "Un gestor de tareas sencillo y eficaz para organizar tus objetivos diarios y mantenerte productivo."
  },
  "ARTICLES": {
    "TITLE": "Articles",
    "VIEW": "Read →",
    "ARTICLE_1_TITLE": "The Power of Clean Code in Modern Web Development",
    "ARTICLE_2_TITLE": "The Real Secret to Fitness Progress",
    "ARTICLE_3_TITLE": "How to Stay Focused and Get More Done in Less Time"
  },
  "CONTACT": {
    "TITLE": "Contact",
    "DOWNLOAD_CV": "Download CV"
  }
}
