{
  "ROUTES": {
    "HOME": "Inicio",
    "PROJECTS": "Proyectos",
    "ARTICLES": "Articulos",
    "CONTACT": "Contacto"
  },
  "COMMON": {
    "SEE_ALL": "Ver todo"
  },
  "HEADER": {
    "TITLE": "Hola, soy Jose Romero.\n Desarrollador front-end \n Viviendo en Barcelona, ​​ES.",
    "TITLE_SMALL": "Jose Romero",
    "DESCRIPTION": "He lanzado este portafolio minimalista donde compartiré mi trabajo como desarrollador, junto con mis proyectos personales, ideas y experiencias. Todo lo que forma parte de mi camino y lo que me inspira a seguir creando.",
    "DESCRIPTION_PROJECTS": "Ideas convertidas en código. Pequeños proyectos donde experimento, aprendo y doy vida a nuevas soluciones.",
    "DESCRIPTION_ARTICLES": "Pensamientos, experiencias y aprendizajes sobre la vida, la tecnología, el fitness y todo lo que me inspira a seguir creciendo.",
    "DESCRIPTION_CONTACT": "¿Tienes un proyecto en mente o solo quieres saludar? Creemos algo genial juntos.",
    "CONTACT": "Contactame →"
  },
  "FOOTER": {
    "TITLE": "© 2025 - Hecho con ♥ por Jose Romero"
  },
  "PROJECTS": {
    "TITLE": "Proyectos",
    "VIEW": "Ver proyecto →",
    "PROJECT_1_TITLE": "Ignis Gravitas",
    "PROJECT_1_DESCRIPTION": "Una aceleradora digital para startups y un exclusivo ecosistema emprendedor en crecimiento.",
    "PROJECT_2_TITLE": "Profit4life",
    "PROJECT_2_DESCRIPTION": "Academia dedicada al Forex y el manejo de inversiones y oportunidades financieras.",
    "PROJECT_3_TITLE": "Átomo Virtual",
    "PROJECT_3_DESCRIPTION": "Agencia de desarrollo web, diseño de sitios y plataformas optimizadas para posicionar.",
    "PROJECT_4_TITLE": "App para correr",
    "PROJECT_4_DESCRIPTION": "Un rastreador de carreras claro y rápido para registrar distancia, ritmo y tiempo, diseñado para la simplicidad y la concentración.",
    "PROJECT_5_TITLE": "App del tiempo",
    "PROJECT_5_DESCRIPTION": "Una app minimalista del tiempo que muestra pronósticos en tiempo real e imágenes claras para cualquier ubicación.",
    "PROJECT_6_TITLE": "App de tareas",
    "PROJECT_6_DESCRIPTION": "Un gestor de tareas sencillo y eficaz para organizar tus objetivos diarios y mantenerte productivo."
  },
  "ARTICLES": {
    "TITLE": "Articulos",
    "VIEW": "Leer →",
    "ARTICLE_1_TITLE": "El poder del código limpio en el desarrollo web moderno",
    "ARTICLE_2_TITLE": "El verdadero secreto para progresar en el fitness",
    "ARTICLE_3_TITLE": "Cómo mantener la concentración y hacer más en menos tiempo"
  },
  "CONTACT": {
    "TITLE": "Contacto",
    "DOWNLOAD_CV": "Descargar CV"
  }
}
