{
  "ROUTES": {
    "HOME": "Inicio",
    "PROJECTS": "Proyectos",
    "ARTICLES": "Articulos",
    "CONTACT": "Contacto"
  },
  "COMMON": {
    "SEE_ALL": "Ver todo"
  },
  "HEADER": {
    "TITLE": "Hola, soy Jose Romero.\n Desarrollador front-end \n Viviendo en Barcelona, ​​ES.",
    "TITLE_SMALL": "Jose Romero",
    "DESCRIPTION": "He lanzado este portafolio minimalista donde compartiré mi trabajo como desarrollador, junto con mis proyectos personales, ideas y experiencias. Todo lo que forma parte de mi camino y lo que me inspira a seguir creando.",
    "DESCRIPTION_PROJECTS": "Ideas convertidas en código. Pequeños proyectos donde experimento, aprendo y doy vida a nuevas soluciones.",
    "DESCRIPTION_ARTICLES": "Pensamientos, experiencias y aprendizajes sobre la vida, la tecnología, el fitness y todo lo que me inspira a seguir creciendo.",
    "DESCRIPTION_CONTACT": "¿Tienes un proyecto en mente o solo quieres saludar? Creemos algo genial juntos.",
    "CONTACT": "Contactame →"
  },
  "FOOTER": {
    "TITLE": "© 2025 - Hecho con ♥ por Jose Romero"
  },
  "PROJECTS": {
    "TITLE": "Proyectos",
    "VIEW": "Ver proyecto →",
    "PROJECT_1_TITLE": "Ignis Gravitas",
    "PROJECT_1_DESCRIPTION": "Una aceleradora digital para startups y un exclusivo ecosistema emprendedor en crecimiento.",
    "PROJECT_2_TITLE": "Profit4life",
    "PROJECT_2_DESCRIPTION": "Academia dedicada al Forex y el manejo de inversiones y oportunidades financieras.",
    "PROJECT_3_TITLE": "Átomo Virtual",
    "PROJECT_3_DESCRIPTION": "Agencia de desarrollo web, diseño de sitios y plataformas optimizadas para posicionar.",
    "PROJECT_4_TITLE": "App para correr",
    "PROJECT_4_DESCRIPTION": "Un rastreador de carreras claro y rápido para registrar distancia, ritmo y tiempo, diseñado para la simplicidad y la concentración.",
    "PROJECT_5_TITLE": "App del tiempo",
    "PROJECT_5_DESCRIPTION": "Una app minimalista del tiempo que muestra pronósticos en tiempo real e imágenes claras para cualquier ubicación.",
    "PROJECT_6_TITLE": "App de tareas",
    "PROJECT_6_DESCRIPTION": "Un gestor de tareas sencillo y eficaz para organizar tus objetivos diarios y mantenerte productivo."
  },
  "ARTICLES": {
    "TITLE": "Articulos",
    "VIEW": "Leer →",
    "ARTICLE_1_TITLE": "La magia de configurar Angular",
    "ARTICLE_1_DESCRIPTION": "Tu proyecto Angular no necesita magia, solo una buena configuración, hay dos tipos de desarrolladores: los que configuran bien un proyecto desde el inicio, y los que, seis meses después, odian abrir su propio código. \n \n Y no te juzgo si estás en el segundo grupo… todos hemos estado ahí. \n \n Configurar un proyecto Angular no es lo más “sexy” del mundo. Nadie presume en LinkedIn que creó un tsconfig limpio o un environment bien separado. Pero si lo haces bien desde el principio, te ahorras noches de frustración y commits con mensajes tipo “fix final final FINAL”. \n \n Piensa que un proyecto mal configurado es como una habitación desordenada: al principio da igual, pero llega un momento en el que ya ni encuentras los calcetines. \n \n Lo mismo pasa con los componentes, los servicios y los módulos: si no los organizas desde el día uno, acabas con una maraña imposible de entender. Un buen punto de partida es definir una estructura de carpetas clara (por features, por dominio o lo que se adapte a tu equipo), un módulo compartido, y asegurarte de que todo el mundo sigue las mismas convenciones. Eso, más un par de configuraciones como eslint, prettier y husky, pueden marcar la diferencia entre un proyecto escalable y una pesadilla en TypeScript. \n \n Y algo importante: no se trata solo de código. También estás configurando cómo trabajas. Tu equipo futuro (o tu “yo” de dentro de 3 meses) te lo agradecerá. \n \n Así que antes de correr con el primer ng g c, tómate un café, respira y deja todo ordenado. No es magia, es buena práctica.\n \n Y como dice el refrán dev: “mejor perder una hora configurando que cien horas arreglando”.",
    "ARTICLE_2_TITLE": "No necesitas ser atleta para cuidar tu cuerpo",
    "ARTICLE_2_DESCRIPTION": "A veces pensamos que hacer ejercicio significa vivir en el gimnasio, usar proteína con sabor a cartón y subir selfies con cara de “modo bestia”. Pero la realidad es que el cuerpo no te pide tanto. Te pide moverte, nada más. \n \n La mayoría del tiempo pasamos sentados: en el trabajo, en el coche, viendo Netflix… y lo peor, nos acostumbramos. Hasta que un día subes un par de escaleras y te das cuenta de que tu cuerpo te dice: “hermano, ¿cuándo fue la última vez que hicimos esto?”.\n \n  La buena noticia es que no necesitas una rutina extrema para mejorar. Caminar 30 minutos, hacer estiramientos al levantarte o subir las escaleras en lugar del ascensor ya cambian las cosas. Tu cuerpo empieza a funcionar mejor, tu mente se despeja y el estrés baja. \n \n Incluso hay estudios que dicen que moverte unos minutos cada hora mejora tu productividad y tu concentración. Así que no solo se trata de verte mejor, sino de sentirte mejor.\n \n  Y sí, habrá días donde no tengas ganas. En esos días, cambia el enfoque: no lo hagas por estética, hazlo por bienestar. Hazlo por ese momento en el que te levantas con energía, por esa sensación después de entrenar donde piensas “valió la pena”.\n \n  Porque, seamos sinceros, todos preferimos 20 minutos de movimiento que 20 minutos de quejas.",
    "ARTICLE_3_TITLE": "Los hábitos son como los intereses del banco",
    "ARTICLE_3_DESCRIPTION": "Los hábitos son como los intereses del banco: pequeños, pero con el tiempo te cambian la vida\n \n Cuando hablamos de “hábitos”, muchos piensan en cosas aburridas: despertarse temprano, comer sano, leer todos los días… y suena como un checklist que da pereza. Pero el truco está en verlos de otra forma: no como una obligación, sino como una herramienta para hacerte la vida más fácil.\n \n Los hábitos no son más que atajos del cerebro. Son esas cosas que haces sin pensar, y por eso son tan poderosos. Si todos los días te acuestas revisando el móvil, ese es un hábito. Si te tomas un vaso de agua al levantarte, también. La diferencia está en cuáles te acercan a lo que quieres y cuáles te alejan.\n \n Y no, no necesitas cambiar toda tu vida en una semana. Empieza con algo pequeño: hacer tu cama, salir a caminar, anotar tres cosas por las que estás agradecido, o simplemente planificar tu día. Cuando repites una acción, tu cerebro crea una ruta más rápida. Y con el tiempo, deja de ser esfuerzo y pasa a ser automático.\n \n De repente, sin darte cuenta, ya no necesitas “motivación” para ser productivo. Solo sigues tu sistema. Y ese es el verdadero secreto de la organización: no tener fuerza de voluntad infinita, sino construir un entorno donde tus buenos hábitos trabajen por ti.\n \n Los resultados no llegan de un día para otro, pero cuando lo hacen, se sienten como magia. Porque sí, los hábitos son pequeños… pero con el tiempo, se vuelven tu superpoder."
  },
  "CONTACT": {
    "TITLE": "Contacto",
    "DOWNLOAD_CV": "Descargar CV"
  }
}
